'''
Корені квадратного рівняння

Python дуже активно застосовують вчені з усього світу у своїх дослідженнях. У цьому завдання ми спробуємо з вами за
допомогою Python знайти коріння квадратного рівняння.
Нагадаємо, що квадратне рівняння виглядає так:
ax2 + bx + c = 0
Якщо ви не пам'ятаєте формулу (а ми й самі її не пам'ятаємо!), що дозволяє знайти корені такого рівняння, зверніться
по допомогу до статті у Вікіпедії.
Ваше завдання написати програму, яка запускається у командному рядку з параметрами, обчислює значення коренів квадратного
рівняння та виводить їх на друк. На вхід до програми подаються коефіцієнти a, b і c. На друк повинно виводитися два корені
квадратного рівняння. Зверніть увагу на те, як виводяться корені - кожен з нового рядка.
Щоб не ускладнювати ваше завдання всі коефіцієнти, які ми будемо подавати вам на вхід, є коефіцієнтами, які в результаті
дають 2 корені квадратного рівняння.
Прочитати коефіцієнти a, b, c ви можете наступним чином:

import sys
a = int(sys.argv[1])
b = int(sys.argv[2])
c = int(sys.argv[3])

Приклади роботи:
$ python solution.py 1 -3 -4
4
-1
$ python solution.py 13 236 -396
1
-19
'''

import sys
a = int(sys.argv[1])
b = int(sys.argv[2])
c = int(sys.argv[3])
d = b * b - 4 * a * c
x1 = (-b + pow(d, 1/2)) / (2 * a)
x2 = (-b - pow(d, 1/2)) / ( 2* a)
print(int(x1))
print(int(x2))

'''
solution from coursera:
import sys
import math
a = int(sys.argv[1])
b = int(sys.argv[2])
c = int(sys.argv[3])
d = b * b - 4 * a * c
x1 = (-b + math.sqrt(d)) / (2 * a)
x2 = (-b - math.sqrt(d)) / (2 * a)
print(int(x1))
print(int(x2))
'''