# Декоратор to_json від Coursera
'''
Незважаючи на простоту завдання, схожий декоратор так чи інакше зустрічається у кожному сучасному веб-додатку на Python.
Завдання допомогло нам розібратися з тим, як працюють звичайні декоратори та звернути увагу на кілька моментів. По-перше,
використання декоратора wraps допоможе вам уникнути проблем з налагодженням та логуванням, по-друге, декоратори практично завжди
пишуться так, щоб їх можна було застосувати до будь-якої функції, тобто у визначенні нової функції використовуються args і kwargs.
'''

import functools
import json


def to_json(func):

    @functools.wraps(func)
    def wrapped(*args, **kwargs):
        result = func(*args, **kwargs)
        return json.dumps(result)

    return wrapped