# Дескриптор з комісією (рішення Coursera)

'''
Завдання практично повністю повторює приклад з лекції, тому проблем з нею виникнути не повинно було. Потрібно лише розібратися з тим,
з якого об'єкта брати комісію. Дескриптори дуже рідко зустрічаються в реальних додатках, проте важливо хоча б на базовому рівні розуміти
принцип їх роботи.
'''

class Value:
    def __init__(self):
        self.amount = 0

    def __get__(self, obj, obj_type):
        return self.amount

    def __set__(self, obj, value):
        self.amount = value - value * obj.commission